In [1]:
import numpy as np 
import pandas as pd

In [2]:
df=pd.read_csv("transactions12.csv")
df

,t_date,cust_id,t_amt,services,products_used,city,state,t_details
0,06-26-2015,4007024,40.33,Exercise & Fitness,Cardio Machine Accessories,Clarksville,Tennessee,credit
1,05-26-2015,4006742,198.44,Exercise & Fitness,Weightlifting Gloves,Long Beach,California,credit
2,06-01-2015,4009775,5.58,Exercise & Fitness,Weightlifting Machine Accessories,Anaheim,California,credit
3,06-05-2015,4002199,198.19,Gymnastics,Gymnastics Rings,Milwaukee,Wisconsin,credit
4,12-17-2015,4002613,98.81,Team Sports,Field Hockey,Nashville,Tennessee,credit
...,...,...,...,...,...,...,...,...
49995,09-18-2015,4005664,53.95,Games,Dice Games,Irving,Texas,credit
49996,10-02-2015,4007287,163.81,Games,Poker Chips & Sets,Kansas City,Missouri,credit
49997,05-03-2015,4003954,35.85,Racquet Sports,Squash,New Orleans,Louisiana,cash
49998,10-23-2015,4007843,180.41,Gymnastics,Vaulting Horses,Berkeley,California,credit
49999,12-14-2015,4001406,168.49,Team Sports,Team Handball,Rockford,Illinois,credit

In [3]:
df["t_date"].nunique()

364

In [4]:
# What is the total sales amount across all transactions?
total_sales=df.groupby("t_details")["t_amt"].sum()

In [5]:
total_sales

t_details
cash       187685.61
credit    4923134.93
Name: t_amt, dtype: float64

In [6]:
# Which month had the highest total transaction amount?
df["t_date"]=pd.to_datetime(df["t_date"],errors='coerce',dayfirst=True)

C:\Users\Sree Charan\AppData\Local\Temp\ipykernel_17072\934809266.py:2: UserWarning: Parsing dates in %m-%d-%Y format when dayfirst=True was specified. Pass `dayfirst=False` or specify a format to silence this warning.
  df["t_date"]=pd.to_datetime(df["t_date"],errors='coerce',dayfirst=True)

In [7]:
df["t_date"].unique()

<DatetimeArray>
['2015-06-26 00:00:00', '2015-05-26 00:00:00', '2015-06-01 00:00:00',
 '2015-06-05 00:00:00', '2015-12-17 00:00:00', '2015-02-14 00:00:00',
 '2015-10-28 00:00:00', '2015-07-14 00:00:00', '2015-01-17 00:00:00',
 '2015-05-17 00:00:00',
 ...
 '2015-07-24 00:00:00', '2015-07-02 00:00:00', '2015-04-03 00:00:00',
 '2015-04-05 00:00:00', '2015-02-07 00:00:00', '2015-09-21 00:00:00',
 '2015-11-20 00:00:00', '2015-11-24 00:00:00', '2015-05-05 00:00:00',
 '2015-04-14 00:00:00']
Length: 364, dtype: datetime64[ns]

In [8]:
df['month']=df['t_date'].dt.month

In [9]:
df

,t_date,cust_id,t_amt,services,products_used,city,state,t_details,month
0,2015-06-26,4007024,40.33,Exercise & Fitness,Cardio Machine Accessories,Clarksville,Tennessee,credit,6
1,2015-05-26,4006742,198.44,Exercise & Fitness,Weightlifting Gloves,Long Beach,California,credit,5
2,2015-06-01,4009775,5.58,Exercise & Fitness,Weightlifting Machine Accessories,Anaheim,California,credit,6
3,2015-06-05,4002199,198.19,Gymnastics,Gymnastics Rings,Milwaukee,Wisconsin,credit,6
4,2015-12-17,4002613,98.81,Team Sports,Field Hockey,Nashville,Tennessee,credit,12
...,...,...,...,...,...,...,...,...,...
49995,2015-09-18,4005664,53.95,Games,Dice Games,Irving,Texas,credit,9
49996,2015-10-02,4007287,163.81,Games,Poker Chips & Sets,Kansas City,Missouri,credit,10
49997,2015-05-03,4003954,35.85,Racquet Sports,Squash,New Orleans,Louisiana,cash,5
49998,2015-10-23,4007843,180.41,Gymnastics,Vaulting Horses,Berkeley,California,credit,10
49999,2015-12-14,4001406,168.49,Team Sports,Team Handball,Rockford,Illinois,credit,12

In [10]:
highest_month=df.groupby("month")["t_amt"].sum().reset_index(name="totalsales")

In [11]:
highest_month

    month  totalsales
0       1   438165.76
1       2   395262.37
2       3   444664.24
3       4   420695.24
4       5   432627.58
5       6   421074.55
6       7   439560.80
7       8   434255.01
8       9   429321.63
9      10   424856.28
10     11   408846.35
11     12   421490.73

In [12]:
highest_month[highest_month['totalsales']==max(highest_month['totalsales'])]

   month  totalsales
2      3   444664.24

In [13]:
# What is the average transaction amount per customer?

In [14]:
df['t_amt'].unique()

array([ 40.33, 198.44,   5.58, ...,  58.55,  10.26,  35.36],
      shape=(17920,))

In [15]:
avg_trans=df.groupby('cust_id')['t_amt'].mean()

In [16]:
avg_trans

cust_id
4000000    127.444000
4000001    108.945556
4000002     56.165000
4000003    123.670000
4000004    168.135000
              ...
4009995     65.018571
4009996    104.515000
4009997    121.547500
4009998    110.950000
4009999     85.252500
Name: t_amt, Length: 9926, dtype: float64

In [17]:
# What is the trend of total sales over months?

In [18]:
trend=df.groupby(['month','products_used'])['t_amt'].max().reset_index(name='max_sales')
trend

      month        products_used  max_sales
0         1  Abdominal Equipment     199.50
1         1           Air Hockey     197.85
2         1            Air Suits     196.24
3         1              Archery     182.46
4         1            Badminton     199.05
...     ...                  ...        ...
1495     12             Wetsuits     193.50
1496     12   Whitewater Rafting     187.44
1497     12          Windsurfing     197.26
1498     12            Wrestling     194.83
1499     12       Yoga & Pilates     196.77

[1500 rows x 3 columns]

In [19]:
trend1=trend.groupby('month')['max_sales'].max().reset_index(name='maxsales')
trend1

    month  maxsales
0       1    199.91
1       2    199.99
2       3    199.94
3       4    199.92
4       5    199.93
5       6    200.00
6       7    199.89
7       8    199.99
8       9    199.96
9      10    199.98
10     11    199.99
11     12    199.91

In [20]:
trend[trend['max_sales']==max(trend1['maxsales'])]

     month products_used  max_sales
724      6   Stopwatches      200.0

In [21]:
# What is the highest single transaction amount recorded?
df[df['t_amt']==max(df['t_amt'])]

,t_date,cust_id,t_amt,services,products_used,city,state,t_details,month
36291,2015-06-23,4005620,200.0,Exercise & Fitness,Stopwatches,Gilbert,Arizona,credit,6

In [22]:
# Which service category contributes the most to total revenue

In [23]:
revenue=df.groupby('services')['t_amt'].sum().reset_index(name='revenues')

In [24]:
revenue

                  services   revenues
0               Air Sports   99316.90
1            Combat Sports  164730.67
2                  Dancing   42603.71
3       Exercise & Fitness  766463.87
4                    Games  374932.70
5               Gymnastics  327225.34
6             Indoor Games  288506.04
7                  Jumping  205842.67
8   Outdoor Play Equipment  294728.28
9       Outdoor Recreation  846678.64
10                 Puzzles   61564.75
11          Racquet Sports  166976.06
12             Team Sports  617461.38
13            Water Sports  531815.97
14           Winter Sports  321973.56

In [25]:
revenue[revenue['revenues']==max(revenue['revenues'])]

             services   revenues
9  Outdoor Recreation  846678.64

In [26]:
# Which product generated the highest revenue

In [27]:
revenue=df.groupby('products_used')['t_amt'].sum().reset_index(name='revenue1')
revenue

           products_used  revenue1
0    Abdominal Equipment  43304.11
1             Air Hockey  40161.11
2              Air Suits  19371.57
3                Archery  37088.66
4              Badminton  44786.19
..                   ...       ...
120             Wetsuits  38980.34
121   Whitewater Rafting  41048.22
122          Windsurfing  43018.68
123            Wrestling  40332.89
124       Yoga & Pilates  47804.94

[125 rows x 2 columns]

In [28]:
revenue[revenue['revenue1']==max(revenue['revenue1'])]

      products_used  revenue1
124  Yoga & Pilates  47804.94

In [29]:
# How does the average transaction amount vary between services?

In [30]:
avg_tra=df.groupby('services')['t_amt'].mean()
avg_tra

services
Air Sports                103.455104
Combat Sports             101.061761
Dancing                   102.907512
Exercise & Fitness        103.660247
Games                     102.272968
Gymnastics                102.385901
Indoor Games              103.074684
Jumping                   102.155171
Outdoor Play Equipment    101.281196
Outdoor Recreation        100.999480
Puzzles                   100.595997
Racquet Sports            103.647461
Team Sports               102.738998
Water Sports              101.899975
Winter Sports             101.217718
Name: t_amt, dtype: float64

In [31]:
# How many unique customers made purchases?
df['cust_id'].nunique()

9926

In [32]:
# Which customers have spent the most overall

In [33]:
a=df.groupby('cust_id')['t_amt'].sum().reset_index(name='spent')
a

      cust_id   spent
0     4000000  637.22
1     4000001  980.51
2     4000002  112.33
3     4000003  371.01
4     4000004  672.54
...       ...     ...
9921  4009995  455.13
9922  4009996  836.12
9923  4009997  486.19
9924  4009998  665.70
9925  4009999  682.02

[9926 rows x 2 columns]

In [34]:
a[a['spent']==max(a['spent'])]

      cust_id   spent
9415  4009485  1973.3

In [35]:
# What is the average number of transactions per customer

In [36]:
a=df.groupby('cust_id')['t_amt'].count().reset_index(name='count')
a

      cust_id  count
0     4000000      5
1     4000001      9
2     4000002      2
3     4000003      3
4     4000004      4
...       ...    ...
9921  4009995      7
9922  4009996      8
9923  4009997      4
9924  4009998      6
9925  4009999      8

[9926 rows x 2 columns]

In [37]:
a['count'].mean()

np.float64(5.037275841225066)

In [38]:
# Are there customers who made multiple purchases in different categories

In [39]:
purchase=df.groupby(['cust_id','products_used'])['products_used'].count().reset_index(name='pur_count')
purchase

       cust_id              products_used  pur_count
0      4000000                    Bowling          1
1      4000000       Cross-Country Skiing          1
2      4000000  Portable Electronic Games          1
3      4000000            Riding Scooters          1
4      4000000                    Running          1
...        ...                        ...        ...
49036  4009999                  Disc Golf          1
49037  4009999                   Football          1
49038  4009999                 Playhouses          1
49039  4009999              Rock Climbing          1
49040  4009999                   Wetsuits          2

[49041 rows x 3 columns]

In [40]:
b=purchase[purchase['pur_count']>=2]
b

       cust_id               products_used  pur_count
41     4000009                Ice Climbing          2
97     4000021                  Parachutes          2
122    4000026                    Football          2
270    4000058               Pommel Horses          2
321    4000070                    Football          2
...        ...                         ...        ...
48808  4009950                     Bowling          2
48812  4009951                  Basketball          2
48852  4009960  Cardio Machine Accessories          2
48968  4009984                  Parachutes          2
49040  4009999                    Wetsuits          2

[948 rows x 3 columns]

In [41]:
# What percentage of customers are repeat buyers?

In [42]:
percentage=(b['cust_id'].count()/df['cust_id'].count())*100
percentage

np.float64(1.8960000000000001)

In [43]:
# Which product category has the highest total sales?

In [44]:
prod_sales=df.groupby('products_used')['t_amt'].sum().reset_index(name='prod_sale')
prod_sales

           products_used  prod_sale
0    Abdominal Equipment   43304.11
1             Air Hockey   40161.11
2              Air Suits   19371.57
3                Archery   37088.66
4              Badminton   44786.19
..                   ...        ...
120             Wetsuits   38980.34
121   Whitewater Rafting   41048.22
122          Windsurfing   43018.68
123            Wrestling   40332.89
124       Yoga & Pilates   47804.94

[125 rows x 2 columns]

In [45]:
prod_sales[prod_sales['prod_sale']==max(prod_sales['prod_sale'])]

      products_used  prod_sale
124  Yoga & Pilates   47804.94

In [46]:
# Which services are most popular by transaction count

In [47]:
df['t_details'].unique()

array(['credit', 'cash'], dtype=object)

In [48]:
trans=df.groupby(['services','t_details'])['t_details'].count().reset_index(name='trans_count')
trans

                  services t_details  trans_count
0               Air Sports      cash          123
1               Air Sports    credit          837
2            Combat Sports      cash          223
3            Combat Sports    credit         1407
4                  Dancing      cash           59
5                  Dancing    credit          355
6       Exercise & Fitness      cash          898
7       Exercise & Fitness    credit         6496
8                    Games      cash          510
9                    Games    credit         3156
10              Gymnastics      cash          453
11              Gymnastics    credit         2743
12            Indoor Games      cash          376
13            Indoor Games    credit         2423
14                 Jumping      cash          264
15                 Jumping    credit         1751
16  Outdoor Play Equipment      cash          410
17  Outdoor Play Equipment    credit         2500
18      Outdoor Recreation      cash         1247
19      Outdoor Recreation    credit         7136
20                 Puzzles      cash           91
21                 Puzzles    credit          521
22          Racquet Sports      cash          218
23          Racquet Sports    credit         1393
24             Team Sports      cash          806
25             Team Sports    credit         5204
26            Water Sports      cash          742
27            Water Sports    credit         4477
28           Winter Sports      cash          429
29           Winter Sports    credit         2752

In [49]:
d=trans[trans['t_details']=='credit']
d

                  services t_details  trans_count
1               Air Sports    credit          837
3            Combat Sports    credit         1407
5                  Dancing    credit          355
7       Exercise & Fitness    credit         6496
9                    Games    credit         3156
11              Gymnastics    credit         2743
13            Indoor Games    credit         2423
15                 Jumping    credit         1751
17  Outdoor Play Equipment    credit         2500
19      Outdoor Recreation    credit         7136
21                 Puzzles    credit          521
23          Racquet Sports    credit         1393
25             Team Sports    credit         5204
27            Water Sports    credit         4477
29           Winter Sports    credit         2752

In [50]:
d[d['trans_count']==max(d['trans_count'])]

              services t_details  trans_count
19  Outdoor Recreation    credit         7136

In [51]:
# For each service, which product type is purchased most frequently

In [52]:
most=df.groupby(['services','products_used'])['products_used'].size().reset_index(name='most_freq')
most=most.sort_values(['services','most_freq'],ascending=[True,False])
most.drop_duplicates('services')

                   services               products_used  most_freq
2                Air Sports                  Parachutes        400
3             Combat Sports                      Boxing        431
7                   Dancing                 Ballet Bars        414
9        Exercise & Fitness  Cardio Machine Accessories        445
32                    Games                     Mahjong        437
35               Gymnastics               Balance Beams        425
47             Indoor Games                    Foosball        422
54                  Jumping                 Trampolines        421
60   Outdoor Play Equipment                  Swing Sets        464
73       Outdoor Recreation                  Lawn Games        466
83                  Puzzles              Jigsaw Puzzles        397
85           Racquet Sports                   Badminton        413
97              Team Sports                      Hockey        434
105            Water Sports                Bodyboarding        425
118           Winter Sports        Cross-Country Skiing        429

In [53]:
# What is the average transaction amount per product type?

In [54]:
avg=df.groupby('products_used')['t_amt'].mean().reset_index(name='avg_trans_amt')

In [55]:
avg

           products_used  avg_trans_amt
0    Abdominal Equipment     105.362798
1             Air Hockey     103.775478
2              Air Suits     101.421832
3                Archery      97.345564
4              Badminton     108.441138
..                   ...            ...
120             Wetsuits     102.042775
121   Whitewater Rafting     102.877744
122          Windsurfing     104.161453
123            Wrestling      97.895364
124       Yoga & Pilates     107.668784

[125 rows x 2 columns]

In [56]:
# Are there specific services where customers spend significantly more?

In [57]:
cust=df.groupby('services')['t_amt'].mean().reset_index(name='spend')

In [58]:
cust

                  services       spend
0               Air Sports  103.455104
1            Combat Sports  101.061761
2                  Dancing  102.907512
3       Exercise & Fitness  103.660247
4                    Games  102.272968
5               Gymnastics  102.385901
6             Indoor Games  103.074684
7                  Jumping  102.155171
8   Outdoor Play Equipment  101.281196
9       Outdoor Recreation  100.999480
10                 Puzzles  100.595997
11          Racquet Sports  103.647461
12             Team Sports  102.738998
13            Water Sports  101.899975
14           Winter Sports  101.217718

In [59]:
cust[cust['spend']==max(cust['spend'])]

             services       spend
3  Exercise & Fitness  103.660247

In [60]:
# Which state has the highest total sales?

In [61]:
state=df.groupby('state')['t_amt'].sum().reset_index(name='total_sales')
state

                   state  total_sales
0                Alabama    116015.34
1                Arizona    131291.33
2             California    702346.23
3               Colorado    178299.70
4            Connecticut     91083.70
5   District of Columbia     49720.36
6                Florida    274858.95
7                Georgia     89437.01
8                 Hawaii     42950.01
9                  Idaho     45031.14
10              Illinois    134022.53
11               Indiana     44615.71
12                  Iowa     46807.73
13                Kansas     92713.35
14              Kentucky     90281.05
15             Louisiana     48836.11
16              Maryland     44926.59
17         Massachusetts    143744.66
18              Michigan     98196.70
19             Minnesota     92497.85
20           Mississippi     47874.66
21              Missouri    132471.38
22              Nebraska     91556.21
23                Nevada     95418.42
24            New Jersey    136848.48
25              New York     98755.56
26        North Carolina     87372.13
27                  Ohio    188613.87
28              Oklahoma     47668.08
29                Oregon    187052.05
30          Pennsylvania     90442.91
31        South Carolina     94946.24
32             Tennessee    177685.79
33                 Texas    541267.24
34                  Utah     92071.16
35              Virginia    144447.26
36            Washington    181508.87
37             Wisconsin    117144.18

In [62]:
state[state['total_sales']==max(state['total_sales'])]

        state  total_sales
2  California    702346.23

In [63]:
# Which city records the highest number of transactions?

In [64]:
trans=df.groupby('city')['t_details'].size().reset_index(name='city_records')
trans[trans['city_records']==max(trans['city_records'])]

        city  city_records
77  Pasadena           939

In [65]:
# What is the average spending per transaction in each state?
state1=df.groupby('state')['t_amt'].mean().reset_index(name='avg_sales')
state1

                   state   avg_sales
0                Alabama  102.487049
1                Arizona  102.172241
2             California  102.652182
3               Colorado  101.537415
4            Connecticut   99.982108
5   District of Columbia  103.800334
6                Florida  103.136567
7                Georgia  102.330675
8                 Hawaii  101.536667
9                  Idaho   98.969538
10              Illinois  100.166315
11               Indiana  100.712664
12                  Iowa  103.100727
13                Kansas  101.436926
14              Kentucky  104.130392
15             Louisiana  103.466335
16              Maryland  100.506913
17         Massachusetts  104.541571
18              Michigan  101.547777
19             Minnesota  103.465157
20           Mississippi  101.214926
21              Missouri  100.969040
22              Nebraska  101.955690
23                Nevada  105.434718
24            New Jersey  103.438005
25              New York  100.259452
26        North Carolina  103.033172
27                  Ohio  101.350817
28              Oklahoma  104.995771
29                Oregon  102.438143
30          Pennsylvania  102.776034
31        South Carolina  103.540065
32             Tennessee   99.265804
33                 Texas  101.379891
34                  Utah  104.507560
35              Virginia  104.976206
36            Washington  101.401603
37             Wisconsin  101.953159

In [66]:
# Are certain services more popular in specific states?
popular=df.groupby(['city','services'])['services'].size().reset_index(name='most_popular')
popular=popular.sort_values(['city','most_popular'],ascending=[True,False])
popular.drop_duplicates('city')

                  city            services  most_popular
3         Alexandria    Exercise & Fitness            69
24             Anaheim  Outdoor Recreation            75
39             Atlanta  Outdoor Recreation            79
54              Austin  Outdoor Recreation            68
69           Baltimore  Outdoor Recreation            80
...                ...                 ...           ...
1551             Tampa  Outdoor Recreation            86
1566         Vancouver  Outdoor Recreation            80
1575        Washington  Exercise & Fitness            78
1590  West Valley City  Exercise & Fitness            65
1605       Westminster  Exercise & Fitness            64

[108 rows x 3 columns]

In [67]:
df['city'].nunique()

108

In [68]:
# Which states buy the most Outdoor Recreation products?

In [69]:
outdoor=df.groupby(['state','services'])['services'].size().reset_index(name="buys")
b=outdoor[outdoor['services']=='Outdoor Recreation']
b.sort_values('buys',ascending=False)

                    state            services  buys
39             California  Outdoor Recreation  1188
504                 Texas  Outdoor Recreation   830
99                Florida  Outdoor Recreation   483
444                Oregon  Outdoor Recreation   335
489             Tennessee  Outdoor Recreation   313
414                  Ohio  Outdoor Recreation   307
54               Colorado  Outdoor Recreation   279
549            Washington  Outdoor Recreation   276
264         Massachusetts  Outdoor Recreation   253
24                Arizona  Outdoor Recreation   247
324              Missouri  Outdoor Recreation   226
369            New Jersey  Outdoor Recreation   225
159              Illinois  Outdoor Recreation   224
9                 Alabama  Outdoor Recreation   191
534              Virginia  Outdoor Recreation   186
564             Wisconsin  Outdoor Recreation   180
294             Minnesota  Outdoor Recreation   169
474        South Carolina  Outdoor Recreation   162
219              Kentucky  Outdoor Recreation   156
204                Kansas  Outdoor Recreation   154
459          Pennsylvania  Outdoor Recreation   154
114               Georgia  Outdoor Recreation   153
399        North Carolina  Outdoor Recreation   153
279              Michigan  Outdoor Recreation   152
339              Nebraska  Outdoor Recreation   149
69            Connecticut  Outdoor Recreation   140
384              New York  Outdoor Recreation   140
519                  Utah  Outdoor Recreation   136
354                Nevada  Outdoor Recreation   135
174               Indiana  Outdoor Recreation    91
144                 Idaho  Outdoor Recreation    81
249              Maryland  Outdoor Recreation    80
309           Mississippi  Outdoor Recreation    78
234             Louisiana  Outdoor Recreation    77
189                  Iowa  Outdoor Recreation    74
129                Hawaii  Outdoor Recreation    72
429              Oklahoma  Outdoor Recreation    70
84   District of Columbia  Outdoor Recreation    64

In [70]:
# Compare average spending between California and Texas customers.

In [71]:
a=df[df['state']=='California']

In [72]:
b=sum(a['t_amt'])

In [73]:
b

702346.23

In [74]:
c=df[df['state']=='Texas']
d=sum(c['t_amt'])
d

541267.24

In [75]:
avg=(b+d)/2

In [76]:
avg

621806.735

In [77]:
# Which quarter of the year saw the highest sales?

In [78]:
quarter=df.groupby(df['t_date'].dt.quarter)['t_amt'].sum().reset_index(name='sums')
quarter

   t_date        sums
0       1  1278092.37
1       2  1274397.37
2       3  1303137.44
3       4  1255193.36

In [79]:
quarter[quarter['sums']==max(quarter['sums'])]

   t_date        sums
2       3  1303137.44

In [80]:
# How does total sales vary month by month?

In [81]:
vary=df.groupby('month')['t_amt'].sum().reset_index(name='sums')

In [82]:
vary1=vary['sums'].rolling(window=2).apply(lambda x: x[0] - x[1],raw=True)

In [83]:
vary['difference']=vary1

In [84]:
vary

    month       sums  difference
0       1  438165.76         NaN
1       2  395262.37    42903.39
2       3  444664.24   -49401.87
3       4  420695.24    23969.00
4       5  432627.58   -11932.34
5       6  421074.55    11553.03
6       7  439560.80   -18486.25
7       8  434255.01     5305.79
8       9  429321.63     4933.38
9      10  424856.28     4465.35
10     11  408846.35    16009.93
11     12  421490.73   -12644.38

In [85]:
# What is the total number of transactions per month?
trans=df.groupby('month')['t_details'].size().reset_index(name='transaction_per_month')
trans

    month  transaction_per_month
0       1                   4268
1       2                   3834
2       3                   4360
3       4                   4175
4       5                   4205
5       6                   4171
6       7                   4252
7       8                   4250
8       9                   4160
9      10                   4181
10     11                   3994
11     12                   4150

In [93]:
# Is there a particular season when sports equipment sales spike?

In [91]:
season=df.groupby(df['t_date'].dt.quarter)['t_amt'].sum().reset_index(name='total_sales')
season

   t_date  total_sales
0       1   1278092.37
1       2   1274397.37
2       3   1303137.44
3       4   1255193.36

In [92]:
season[season['total_sales']==max(season['total_sales'])]

   t_date  total_sales
2       3   1303137.44

In [96]:
# How many transactions were done using credit?
c=df[df['t_details']=='credit']
c

,t_date,cust_id,t_amt,services,products_used,city,state,t_details,month
0,2015-06-26,4007024,40.33,Exercise & Fitness,Cardio Machine Accessories,Clarksville,Tennessee,credit,6
1,2015-05-26,4006742,198.44,Exercise & Fitness,Weightlifting Gloves,Long Beach,California,credit,5
2,2015-06-01,4009775,5.58,Exercise & Fitness,Weightlifting Machine Accessories,Anaheim,California,credit,6
3,2015-06-05,4002199,198.19,Gymnastics,Gymnastics Rings,Milwaukee,Wisconsin,credit,6
4,2015-12-17,4002613,98.81,Team Sports,Field Hockey,Nashville,Tennessee,credit,12
...,...,...,...,...,...,...,...,...,...
49994,2015-01-05,4005772,177.22,Outdoor Recreation,Archery,Baltimore,Maryland,credit,1
49995,2015-09-18,4005664,53.95,Games,Dice Games,Irving,Texas,credit,9
49996,2015-10-02,4007287,163.81,Games,Poker Chips & Sets,Kansas City,Missouri,credit,10
49998,2015-10-23,4007843,180.41,Gymnastics,Vaulting Horses,Berkeley,California,credit,10
49999,2015-12-14,4001406,168.49,Team Sports,Team Handball,Rockford,Illinois,credit,12

In [98]:
c['t_details'].count()

np.int64(43151)

In [100]:
# What is the total revenue generated from credit transactions?
c['t_amt'].sum()

np.float64(4923134.930000001)

In [109]:
# Which states or cities should the company focus on for marketing high-value products?

In [106]:
state=df.groupby('state')['t_amt'].sum().reset_index(name='focus1')
state

                   state     focus1
0                Alabama  116015.34
1                Arizona  131291.33
2             California  702346.23
3               Colorado  178299.70
4            Connecticut   91083.70
5   District of Columbia   49720.36
6                Florida  274858.95
7                Georgia   89437.01
8                 Hawaii   42950.01
9                  Idaho   45031.14
10              Illinois  134022.53
11               Indiana   44615.71
12                  Iowa   46807.73
13                Kansas   92713.35
14              Kentucky   90281.05
15             Louisiana   48836.11
16              Maryland   44926.59
17         Massachusetts  143744.66
18              Michigan   98196.70
19             Minnesota   92497.85
20           Mississippi   47874.66
21              Missouri  132471.38
22              Nebraska   91556.21
23                Nevada   95418.42
24            New Jersey  136848.48
25              New York   98755.56
26        North Carolina   87372.13
27                  Ohio  188613.87
28              Oklahoma   47668.08
29                Oregon  187052.05
30          Pennsylvania   90442.91
31        South Carolina   94946.24
32             Tennessee  177685.79
33                 Texas  541267.24
34                  Utah   92071.16
35              Virginia  144447.26
36            Washington  181508.87
37             Wisconsin  117144.18

In [107]:
state[state['focus1']==max(state['focus1'])]

        state     focus1
2  California  702346.23

In [108]:
city=df.groupby('city')['t_amt'].sum().reset_index(name='focus2')
city[city['focus2']==max(city['focus2'])]

        city    focus2
77  Pasadena  95533.98

In [110]:
# Should more inventory be stocked for Exercise & Fitness products given their popularity?
df

,t_date,cust_id,t_amt,services,products_used,city,state,t_details,month
0,2015-06-26,4007024,40.33,Exercise & Fitness,Cardio Machine Accessories,Clarksville,Tennessee,credit,6
1,2015-05-26,4006742,198.44,Exercise & Fitness,Weightlifting Gloves,Long Beach,California,credit,5
2,2015-06-01,4009775,5.58,Exercise & Fitness,Weightlifting Machine Accessories,Anaheim,California,credit,6
3,2015-06-05,4002199,198.19,Gymnastics,Gymnastics Rings,Milwaukee,Wisconsin,credit,6
4,2015-12-17,4002613,98.81,Team Sports,Field Hockey,Nashville,Tennessee,credit,12
...,...,...,...,...,...,...,...,...,...
49995,2015-09-18,4005664,53.95,Games,Dice Games,Irving,Texas,credit,9
49996,2015-10-02,4007287,163.81,Games,Poker Chips & Sets,Kansas City,Missouri,credit,10
49997,2015-05-03,4003954,35.85,Racquet Sports,Squash,New Orleans,Louisiana,cash,5
49998,2015-10-23,4007843,180.41,Gymnastics,Vaulting Horses,Berkeley,California,credit,10
49999,2015-12-14,4001406,168.49,Team Sports,Team Handball,Rockford,Illinois,credit,12

In [111]:
df[df["services"] == "Exercise & Fitness"]["products_used"].value_counts()

products_used
Cardio Machine Accessories           445
Yoga & Pilates                       444
Weightlifting Belts                  429
Weight Benches                       424
Weightlifting Machines               419
Stopwatches                          419
Exercise Balls                       418
Foam Rollers                         418
Abdominal Equipment                  411
Free Weight Bars                     410
Medicine Balls                       410
Free Weights                         409
Cardio Machines                      403
Jump Ropes                           400
Weightlifting Machine Accessories    392
Weightlifting Gloves                 390
Gym Mats                             383
Exercise Bands                       370
Name: count, dtype: int64

In [116]:
mea=df.groupby([df["services"]=='Exercise & Fitness','products_used'])["t_amt"].mean().reset_index(name='a')

In [119]:
mea[mea['services']==True]

     services                      products_used           a
107      True                Abdominal Equipment  105.362798
108      True         Cardio Machine Accessories  104.461888
109      True                    Cardio Machines  101.493548
110      True                     Exercise Balls  107.999617
111      True                     Exercise Bands  101.837162
112      True                       Foam Rollers  102.342536
113      True                   Free Weight Bars  102.233220
114      True                       Free Weights  102.607824
115      True                           Gym Mats  102.545666
116      True                         Jump Ropes  101.671050
117      True                     Medicine Balls  104.387463
118      True                        Stopwatches  106.070453
119      True                     Weight Benches  102.532288
120      True                Weightlifting Belts  105.155431
121      True               Weightlifting Gloves   98.560821
122      True  Weightlifting Machine Accessories  106.048750
123      True             Weightlifting Machines  101.912649
124      True                     Yoga & Pilates  107.668784

In [134]:
# Are there product categories with high sales but low average transaction amounts?

In [133]:
category_stats = (
    df.groupby("products_used")
    .agg(
        total_sales=("t_amt", "count"),
        avg_transaction=("t_amt", "mean")
    )
    .sort_values(by="total_sales", ascending=False)
)

category_stats

                            total_sales  avg_transaction
products_used
Lawn Games                          466       100.490215
Swing Sets                          464       101.733060
Golf                                452       103.047965
Cardio Machine Accessories          445       104.461888
Yoga & Pilates                      444       107.668784
...                                 ...              ...
Disc Golf                           357        95.081289
Kitesurfing                         357       105.688768
Surfing                             354        99.065198
Mechanical Puzzles                  215        94.798465
Air Suits                           191       101.421832

[125 rows x 2 columns]

In [135]:
# Are there underperforming service categories that need promotional offers?
df

,t_date,cust_id,t_amt,services,products_used,city,state,t_details,month
0,2015-06-26,4007024,40.33,Exercise & Fitness,Cardio Machine Accessories,Clarksville,Tennessee,credit,6
1,2015-05-26,4006742,198.44,Exercise & Fitness,Weightlifting Gloves,Long Beach,California,credit,5
2,2015-06-01,4009775,5.58,Exercise & Fitness,Weightlifting Machine Accessories,Anaheim,California,credit,6
3,2015-06-05,4002199,198.19,Gymnastics,Gymnastics Rings,Milwaukee,Wisconsin,credit,6
4,2015-12-17,4002613,98.81,Team Sports,Field Hockey,Nashville,Tennessee,credit,12
...,...,...,...,...,...,...,...,...,...
49995,2015-09-18,4005664,53.95,Games,Dice Games,Irving,Texas,credit,9
49996,2015-10-02,4007287,163.81,Games,Poker Chips & Sets,Kansas City,Missouri,credit,10
49997,2015-05-03,4003954,35.85,Racquet Sports,Squash,New Orleans,Louisiana,cash,5
49998,2015-10-23,4007843,180.41,Gymnastics,Vaulting Horses,Berkeley,California,credit,10
49999,2015-12-14,4001406,168.49,Team Sports,Team Handball,Rockford,Illinois,credit,12

In [138]:
category_stats = (
    df.groupby("services")
    .agg(
        total_sales=("t_amt", "count"),
        sums=("t_amt", "sum")
    )
    .sort_values(by="total_sales", ascending=True)
)

category_stats

                        total_sales       sums
services
Dancing                         414   42603.71
Puzzles                         612   61564.75
Air Sports                      960   99316.90
Racquet Sports                 1611  166976.06
Combat Sports                  1630  164730.67
Jumping                        2015  205842.67
Indoor Games                   2799  288506.04
Outdoor Play Equipment         2910  294728.28
Winter Sports                  3181  321973.56
Gymnastics                     3196  327225.34
Games                          3666  374932.70
Water Sports                   5219  531815.97
Team Sports                    6010  617461.38
Exercise & Fitness             7394  766463.87
Outdoor Recreation             8383  846678.64

In [140]:
s=category_stats['sums'].mean()
s

np.float64(340721.36933333334)

In [144]:
category_stats['promotional_offers']=category_stats['sums'].apply(lambda x: True if x<s else False)

In [145]:
category_stats

                        total_sales       sums  promotional_offers
services
Dancing                         414   42603.71                True
Puzzles                         612   61564.75                True
Air Sports                      960   99316.90                True
Racquet Sports                 1611  166976.06                True
Combat Sports                  1630  164730.67                True
Jumping                        2015  205842.67                True
Indoor Games                   2799  288506.04                True
Outdoor Play Equipment         2910  294728.28                True
Winter Sports                  3181  321973.56                True
Gymnastics                     3196  327225.34                True
Games                          3666  374932.70               False
Water Sports                   5219  531815.97               False
Team Sports                    6010  617461.38               False
Exercise & Fitness             7394  766463.87               False
Outdoor Recreation             8383  846678.64               False